УТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТехподдержкаЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_УправлениеДоступомВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление доступом вызов сервера
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ УПРАВЛЕНИЯ ДОСТУПОМ

// Функция проверяет, есть ли доступ к контактной информации клиента у переданного пользователя.
//
// Параметры:
//	Клиент						- СправочникСсылка	- Клиент, владелец контакта.
//	Пользователь				- СправочникСсылка	- Пользователь, права которого проверяются.
//	ПроверятьВверхПоИерархии	- Булево			- Признак проверки пользователей вышестоящих подразделений.
//
// Возвращаемое значение:
//	Булево	- Наличие прав доступа к контактной информации.
//
Функция ЕстьДоступУровняАккаунтМенеджера(Клиент, Знач Пользователь = Неопределено,
	 ПроверятьВверхПоИерархии = Истина) Экспорт
	
	// Если не заполнен клиент, то нет управления защитой.
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// У пользователей с полными правами всегда есть доступ уровня аккаунт менеджера.
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если пользователь не указан, то проверяем текущего пользователя.
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	АккаунтМенеджер = Клиент.ОсновнойМенеджер;
	Если НЕ ЗначениеЗаполнено(АккаунтМенеджер) Тогда
		Возврат Истина;
	КонецЕсли;
	// Если пользователь не является пользователе БД - даем доступ всем.
	Если НЕ ЗначениеЗаполнено(АккаунтМенеджер.ИдентификаторПользователяИБ) Тогда
		Возврат Истина;
	КонецЕсли;
	// Если текущий пользователь является аккаунт-менеджером, то есть права доступа.
	Если Пользователь = АккаунтМенеджер Тогда
		Возврат Истина;
	КонецЕсли;
	// Проверяем, является ли пользователь руководителем в одном из вышестоящих подразделений или подразделении
	// аккаунт-менеджера.
	МассивРуководителей = CRM_УправлениеДоступомПовтИсп.ПолучитьРуководителейПользователя(АккаунтМенеджер);
	Если НЕ (МассивРуководителей.Найти(Пользователь) = Неопределено) Тогда
		Возврат Истина;
	КонецЕсли;
	// Проверяем,входит ли пользователь в одно из вышестоящих подразделений.
	МассивПользователей = CRM_УправлениеДоступомПовтИсп.ПолучитьПользователейВышестоящихПодразделений(АккаунтМенеджер);
	Если НЕ (МассивПользователей.Найти(Пользователь) = Неопределено) Тогда
		Возврат Истина;
	КонецЕсли;
	// Если не сработало ни одно условие.
	Возврат Ложь;
КонецФункции // ЕстьДоступУровняАккаунтМенеджера()

// Функция возвращает аккаунт-менеджера для переданного контакта.
//
// Параметры:
//	Контакт	- СправочникСсылка	- Клиент или контакт, для которого возвращается аккаунт-менеджер.
//
// Возвращаемое значение:
//	СправочникСсылка	- Аккаунт-менеджер
//
Функция ПолучитьАккаунтМенеджера(Контакт) Экспорт
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Возврат Контакт.ОсновнойМенеджер;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Возврат Контакт.Владелец.ОсновнойМенеджер;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
КонецФункции // ПолучитьАккаунтМенеджера()

#КонецОбласти
